apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
//*****************************************************************************
//
//  am_mcu_apollo3_info0.h
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2021, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk_3_0_0-742e5ac27c of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_INFO0_H
#define AM_REG_INFO0_H

#define AM_REG_INFO0_BASEADDR 0x50020000
#define AM_REG_INFO0n(n) 0x50020000

#define AM_REG_INFO0_SIGNATURE0_O 0x00000000
#define AM_REG_INFO0_SIGNATURE0_ADDR 0x50020000
#define AM_REG_INFO0_SIGNATURE1_O 0x00000004
#define AM_REG_INFO0_SIGNATURE1_ADDR 0x50020004
#define AM_REG_INFO0_SIGNATURE2_O 0x00000008
#define AM_REG_INFO0_SIGNATURE2_ADDR 0x50020008
#define AM_REG_INFO0_SIGNATURE3_O 0x0000000c
#define AM_REG_INFO0_SIGNATURE3_ADDR 0x5002000c
#define AM_REG_INFO0_SECURITY_O 0x00000010
#define AM_REG_INFO0_SECURITY_ADDR 0x50020010
#define AM_REG_INFO0_CUSTOMER_TRIM_O 0x00000014
#define AM_REG_INFO0_CUSTOMER_TRIM_ADDR 0x50020014
#define AM_REG_INFO0_CUSTOMER_TRIM2_O 0x00000018
#define AM_REG_INFO0_CUSTOMER_TRIM2_ADDR 0x50020018
#define AM_REG_INFO0_SECURITY_OVR_O 0x00000020
#define AM_REG_INFO0_SECURITY_OVR_ADDR 0x50020020
#define AM_REG_INFO0_SECURITY_WIRED_CFG_O 0x00000024
#define AM_REG_INFO0_SECURITY_WIRED_CFG_ADDR 0x50020024
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_O 0x00000028
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_ADDR 0x50020028
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_O 0x0000002c
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_ADDR 0x5002002c
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_O 0x00000030
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ADDR 0x50020030
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_O 0x00000034
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ADDR 0x50020034
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_O 0x00000038
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ADDR 0x50020038
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_O 0x0000003c
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ADDR 0x5002003c
#define AM_REG_INFO0_SECURITY_VERSION_O 0x00000040
#define AM_REG_INFO0_SECURITY_VERSION_ADDR 0x50020040
#define AM_REG_INFO0_SECURITY_SRAM_RESV_O 0x00000050
#define AM_REG_INFO0_SECURITY_SRAM_RESV_ADDR 0x50020050
#define AM_REG_INFO0_WRITE_PROTECT_L_O 0x000001f8
#define AM_REG_INFO0_WRITE_PROTECT_L_ADDR 0x500201f8
#define AM_REG_INFO0_WRITE_PROTECT_H_O 0x000001fc
#define AM_REG_INFO0_WRITE_PROTECT_H_ADDR 0x500201fc
#define AM_REG_INFO0_COPY_PROTECT_L_O 0x00000200
#define AM_REG_INFO0_COPY_PROTECT_L_ADDR 0x50020200
#define AM_REG_INFO0_COPY_PROTECT_H_O 0x00000204
#define AM_REG_INFO0_COPY_PROTECT_H_ADDR 0x50020204
#define AM_REG_INFO0_WRITE_PROTECT_SBL_L_O 0x000009f8
#define AM_REG_INFO0_WRITE_PROTECT_SBL_L_ADDR 0x500209f8
#define AM_REG_INFO0_WRITE_PROTECT_SBL_H_O 0x000009fc
#define AM_REG_INFO0_WRITE_PROTECT_SBL_H_ADDR 0x500209fc
#define AM_REG_INFO0_COPY_PROTECT_SBL_L_O 0x00000a00
#define AM_REG_INFO0_COPY_PROTECT_SBL_L_ADDR 0x50020a00
#define AM_REG_INFO0_COPY_PROTECT_SBL_H_O 0x00000a04
#define AM_REG_INFO0_COPY_PROTECT_SBL_H_ADDR 0x50020a04
#define AM_REG_INFO0_MAIN_PTR0_O 0x00000c00
#define AM_REG_INFO0_MAIN_PTR0_ADDR 0x50020c00
#define AM_REG_INFO0_MAIN_PTR1_O 0x00000c04
#define AM_REG_INFO0_MAIN_PTR1_ADDR 0x50020c04
#define AM_REG_INFO0_KREVTRACK_O 0x00000c08
#define AM_REG_INFO0_KREVTRACK_ADDR 0x50020c08
#define AM_REG_INFO0_AREVTRACK_O 0x00000c0c
#define AM_REG_INFO0_AREVTRACK_ADDR 0x50020c0c
#define AM_REG_INFO0_OTA_DESCRIPTOR_O 0x00000c10
#define AM_REG_INFO0_OTA_DESCRIPTOR_ADDR 0x50020c10
#define AM_REG_INFO0_MAIN_CNT0_O 0x00000ff8
#define AM_REG_INFO0_MAIN_CNT0_ADDR 0x50020ff8
#define AM_REG_INFO0_MAIN_CNT1_O 0x00000ffc
#define AM_REG_INFO0_MAIN_CNT1_ADDR 0x50020ffc
#define AM_REG_INFO0_CUST_KEK_W0_O 0x00001800
#define AM_REG_INFO0_CUST_KEK_W0_ADDR 0x50021800
#define AM_REG_INFO0_CUST_KEK_W1_O 0x00001804
#define AM_REG_INFO0_CUST_KEK_W1_ADDR 0x50021804
#define AM_REG_INFO0_CUST_KEK_W2_O 0x00001808
#define AM_REG_INFO0_CUST_KEK_W2_ADDR 0x50021808
#define AM_REG_INFO0_CUST_KEK_W3_O 0x0000180c
#define AM_REG_INFO0_CUST_KEK_W3_ADDR 0x5002180c
#define AM_REG_INFO0_CUST_KEK_W4_O 0x00001810
#define AM_REG_INFO0_CUST_KEK_W4_ADDR 0x50021810
#define AM_REG_INFO0_CUST_KEK_W5_O 0x00001814
#define AM_REG_INFO0_CUST_KEK_W5_ADDR 0x50021814
#define AM_REG_INFO0_CUST_KEK_W6_O 0x00001818
#define AM_REG_INFO0_CUST_KEK_W6_ADDR 0x50021818
#define AM_REG_INFO0_CUST_KEK_W7_O 0x0000181c
#define AM_REG_INFO0_CUST_KEK_W7_ADDR 0x5002181c
#define AM_REG_INFO0_CUST_KEK_W8_O 0x00001820
#define AM_REG_INFO0_CUST_KEK_W8_ADDR 0x50021820
#define AM_REG_INFO0_CUST_KEK_W9_O 0x00001824
#define AM_REG_INFO0_CUST_KEK_W9_ADDR 0x50021824
#define AM_REG_INFO0_CUST_KEK_W10_O 0x00001828
#define AM_REG_INFO0_CUST_KEK_W10_ADDR 0x50021828
#define AM_REG_INFO0_CUST_KEK_W11_O 0x0000182c
#define AM_REG_INFO0_CUST_KEK_W11_ADDR 0x5002182c
#define AM_REG_INFO0_CUST_KEK_W12_O 0x00001830
#define AM_REG_INFO0_CUST_KEK_W12_ADDR 0x50021830
#define AM_REG_INFO0_CUST_KEK_W13_O 0x00001834
#define AM_REG_INFO0_CUST_KEK_W13_ADDR 0x50021834
#define AM_REG_INFO0_CUST_KEK_W14_O 0x00001838
#define AM_REG_INFO0_CUST_KEK_W14_ADDR 0x50021838
#define AM_REG_INFO0_CUST_KEK_W15_O 0x0000183c
#define AM_REG_INFO0_CUST_KEK_W15_ADDR 0x5002183c
#define AM_REG_INFO0_CUST_KEK_W16_O 0x00001840
#define AM_REG_INFO0_CUST_KEK_W16_ADDR 0x50021840
#define AM_REG_INFO0_CUST_KEK_W17_O 0x00001844
#define AM_REG_INFO0_CUST_KEK_W17_ADDR 0x50021844
#define AM_REG_INFO0_CUST_KEK_W18_O 0x00001848
#define AM_REG_INFO0_CUST_KEK_W18_ADDR 0x50021848
#define AM_REG_INFO0_CUST_KEK_W19_O 0x0000184c
#define AM_REG_INFO0_CUST_KEK_W19_ADDR 0x5002184c
#define AM_REG_INFO0_CUST_KEK_W20_O 0x00001850
#define AM_REG_INFO0_CUST_KEK_W20_ADDR 0x50021850
#define AM_REG_INFO0_CUST_KEK_W21_O 0x00001854
#define AM_REG_INFO0_CUST_KEK_W21_ADDR 0x50021854
#define AM_REG_INFO0_CUST_KEK_W22_O 0x00001858
#define AM_REG_INFO0_CUST_KEK_W22_ADDR 0x50021858
#define AM_REG_INFO0_CUST_KEK_W23_O 0x0000185c
#define AM_REG_INFO0_CUST_KEK_W23_ADDR 0x5002185c
#define AM_REG_INFO0_CUST_KEK_W24_O 0x00001860
#define AM_REG_INFO0_CUST_KEK_W24_ADDR 0x50021860
#define AM_REG_INFO0_CUST_KEK_W25_O 0x00001864
#define AM_REG_INFO0_CUST_KEK_W25_ADDR 0x50021864
#define AM_REG_INFO0_CUST_KEK_W26_O 0x00001868
#define AM_REG_INFO0_CUST_KEK_W26_ADDR 0x50021868
#define AM_REG_INFO0_CUST_KEK_W27_O 0x0000186c
#define AM_REG_INFO0_CUST_KEK_W27_ADDR 0x5002186c
#define AM_REG_INFO0_CUST_KEK_W28_O 0x00001870
#define AM_REG_INFO0_CUST_KEK_W28_ADDR 0x50021870
#define AM_REG_INFO0_CUST_KEK_W29_O 0x00001874
#define AM_REG_INFO0_CUST_KEK_W29_ADDR 0x50021874
#define AM_REG_INFO0_CUST_KEK_W30_O 0x00001878
#define AM_REG_INFO0_CUST_KEK_W30_ADDR 0x50021878
#define AM_REG_INFO0_CUST_KEK_W31_O 0x0000187c
#define AM_REG_INFO0_CUST_KEK_W31_ADDR 0x5002187c
#define AM_REG_INFO0_CUST_AUTH_W0_O 0x00001880
#define AM_REG_INFO0_CUST_AUTH_W0_ADDR 0x50021880
#define AM_REG_INFO0_CUST_AUTH_W1_O 0x00001884
#define AM_REG_INFO0_CUST_AUTH_W1_ADDR 0x50021884
#define AM_REG_INFO0_CUST_AUTH_W2_O 0x00001888
#define AM_REG_INFO0_CUST_AUTH_W2_ADDR 0x50021888
#define AM_REG_INFO0_CUST_AUTH_W3_O 0x0000188c
#define AM_REG_INFO0_CUST_AUTH_W3_ADDR 0x5002188c
#define AM_REG_INFO0_CUST_AUTH_W4_O 0x00001890
#define AM_REG_INFO0_CUST_AUTH_W4_ADDR 0x50021890
#define AM_REG_INFO0_CUST_AUTH_W5_O 0x00001894
#define AM_REG_INFO0_CUST_AUTH_W5_ADDR 0x50021894
#define AM_REG_INFO0_CUST_AUTH_W6_O 0x00001898
#define AM_REG_INFO0_CUST_AUTH_W6_ADDR 0x50021898
#define AM_REG_INFO0_CUST_AUTH_W7_O 0x0000189c
#define AM_REG_INFO0_CUST_AUTH_W7_ADDR 0x5002189c
#define AM_REG_INFO0_CUST_AUTH_W8_O 0x000018a0
#define AM_REG_INFO0_CUST_AUTH_W8_ADDR 0x500218a0
#define AM_REG_INFO0_CUST_AUTH_W9_O 0x000018a4
#define AM_REG_INFO0_CUST_AUTH_W9_ADDR 0x500218a4
#define AM_REG_INFO0_CUST_AUTH_W10_O 0x000018a8
#define AM_REG_INFO0_CUST_AUTH_W10_ADDR 0x500218a8
#define AM_REG_INFO0_CUST_AUTH_W11_O 0x000018ac
#define AM_REG_INFO0_CUST_AUTH_W11_ADDR 0x500218ac
#define AM_REG_INFO0_CUST_AUTH_W12_O 0x000018b0
#define AM_REG_INFO0_CUST_AUTH_W12_ADDR 0x500218b0
#define AM_REG_INFO0_CUST_AUTH_W13_O 0x000018b4
#define AM_REG_INFO0_CUST_AUTH_W13_ADDR 0x500218b4
#define AM_REG_INFO0_CUST_AUTH_W14_O 0x000018b8
#define AM_REG_INFO0_CUST_AUTH_W14_ADDR 0x500218b8
#define AM_REG_INFO0_CUST_AUTH_W15_O 0x000018bc
#define AM_REG_INFO0_CUST_AUTH_W15_ADDR 0x500218bc
#define AM_REG_INFO0_CUST_AUTH_W16_O 0x000018c0
#define AM_REG_INFO0_CUST_AUTH_W16_ADDR 0x500218c0
#define AM_REG_INFO0_CUST_AUTH_W17_O 0x000018c4
#define AM_REG_INFO0_CUST_AUTH_W17_ADDR 0x500218c4
#define AM_REG_INFO0_CUST_AUTH_W18_O 0x000018c8
#define AM_REG_INFO0_CUST_AUTH_W18_ADDR 0x500218c8
#define AM_REG_INFO0_CUST_AUTH_W19_O 0x000018cc
#define AM_REG_INFO0_CUST_AUTH_W19_ADDR 0x500218cc
#define AM_REG_INFO0_CUST_AUTH_W20_O 0x000018d0
#define AM_REG_INFO0_CUST_AUTH_W20_ADDR 0x500218d0
#define AM_REG_INFO0_CUST_AUTH_W21_O 0x000018d4
#define AM_REG_INFO0_CUST_AUTH_W21_ADDR 0x500218d4
#define AM_REG_INFO0_CUST_AUTH_W22_O 0x000018d8
#define AM_REG_INFO0_CUST_AUTH_W22_ADDR 0x500218d8
#define AM_REG_INFO0_CUST_AUTH_W23_O 0x000018dc
#define AM_REG_INFO0_CUST_AUTH_W23_ADDR 0x500218dc
#define AM_REG_INFO0_CUST_AUTH_W24_O 0x000018e0
#define AM_REG_INFO0_CUST_AUTH_W24_ADDR 0x500218e0
#define AM_REG_INFO0_CUST_AUTH_W25_O 0x000018e4
#define AM_REG_INFO0_CUST_AUTH_W25_ADDR 0x500218e4
#define AM_REG_INFO0_CUST_AUTH_W26_O 0x000018e8
#define AM_REG_INFO0_CUST_AUTH_W26_ADDR 0x500218e8
#define AM_REG_INFO0_CUST_AUTH_W27_O 0x000018ec
#define AM_REG_INFO0_CUST_AUTH_W27_ADDR 0x500218ec
#define AM_REG_INFO0_CUST_AUTH_W28_O 0x000018f0
#define AM_REG_INFO0_CUST_AUTH_W28_ADDR 0x500218f0
#define AM_REG_INFO0_CUST_AUTH_W29_O 0x000018f4
#define AM_REG_INFO0_CUST_AUTH_W29_ADDR 0x500218f4
#define AM_REG_INFO0_CUST_AUTH_W30_O 0x000018f8
#define AM_REG_INFO0_CUST_AUTH_W30_ADDR 0x500218f8
#define AM_REG_INFO0_CUST_AUTH_W31_O 0x000018fc
#define AM_REG_INFO0_CUST_AUTH_W31_ADDR 0x500218fc
#define AM_REG_INFO0_CUST_PUBKEY_W0_O 0x00001900
#define AM_REG_INFO0_CUST_PUBKEY_W0_ADDR 0x50021900
#define AM_REG_INFO0_CUST_PUBKEY_W1_O 0x00001904
#define AM_REG_INFO0_CUST_PUBKEY_W1_ADDR 0x50021904
#define AM_REG_INFO0_CUST_PUBKEY_W2_O 0x00001908
#define AM_REG_INFO0_CUST_PUBKEY_W2_ADDR 0x50021908
#define AM_REG_INFO0_CUST_PUBKEY_W3_O 0x0000190c
#define AM_REG_INFO0_CUST_PUBKEY_W3_ADDR 0x5002190c
#define AM_REG_INFO0_CUST_PUBKEY_W4_O 0x00001910
#define AM_REG_INFO0_CUST_PUBKEY_W4_ADDR 0x50021910
#define AM_REG_INFO0_CUST_PUBKEY_W5_O 0x00001914
#define AM_REG_INFO0_CUST_PUBKEY_W5_ADDR 0x50021914
#define AM_REG_INFO0_CUST_PUBKEY_W6_O 0x00001918
#define AM_REG_INFO0_CUST_PUBKEY_W6_ADDR 0x50021918
#define AM_REG_INFO0_CUST_PUBKEY_W7_O 0x0000191c
#define AM_REG_INFO0_CUST_PUBKEY_W7_ADDR 0x5002191c
#define AM_REG_INFO0_CUST_PUBKEY_W8_O 0x00001920
#define AM_REG_INFO0_CUST_PUBKEY_W8_ADDR 0x50021920
#define AM_REG_INFO0_CUST_PUBKEY_W9_O 0x00001924
#define AM_REG_INFO0_CUST_PUBKEY_W9_ADDR 0x50021924
#define AM_REG_INFO0_CUST_PUBKEY_W10_O 0x00001928
#define AM_REG_INFO0_CUST_PUBKEY_W10_ADDR 0x50021928
#define AM_REG_INFO0_CUST_PUBKEY_W11_O 0x0000192c
#define AM_REG_INFO0_CUST_PUBKEY_W11_ADDR 0x5002192c
#define AM_REG_INFO0_CUST_PUBKEY_W12_O 0x00001930
#define AM_REG_INFO0_CUST_PUBKEY_W12_ADDR 0x50021930
#define AM_REG_INFO0_CUST_PUBKEY_W13_O 0x00001934
#define AM_REG_INFO0_CUST_PUBKEY_W13_ADDR 0x50021934
#define AM_REG_INFO0_CUST_PUBKEY_W14_O 0x00001938
#define AM_REG_INFO0_CUST_PUBKEY_W14_ADDR 0x50021938
#define AM_REG_INFO0_CUST_PUBKEY_W15_O 0x0000193c
#define AM_REG_INFO0_CUST_PUBKEY_W15_ADDR 0x5002193c
#define AM_REG_INFO0_CUST_PUBKEY_W16_O 0x00001940
#define AM_REG_INFO0_CUST_PUBKEY_W16_ADDR 0x50021940
#define AM_REG_INFO0_CUST_PUBKEY_W17_O 0x00001944
#define AM_REG_INFO0_CUST_PUBKEY_W17_ADDR 0x50021944
#define AM_REG_INFO0_CUST_PUBKEY_W18_O 0x00001948
#define AM_REG_INFO0_CUST_PUBKEY_W18_ADDR 0x50021948
#define AM_REG_INFO0_CUST_PUBKEY_W19_O 0x0000194c
#define AM_REG_INFO0_CUST_PUBKEY_W19_ADDR 0x5002194c
#define AM_REG_INFO0_CUST_PUBKEY_W20_O 0x00001950
#define AM_REG_INFO0_CUST_PUBKEY_W20_ADDR 0x50021950
#define AM_REG_INFO0_CUST_PUBKEY_W21_O 0x00001954
#define AM_REG_INFO0_CUST_PUBKEY_W21_ADDR 0x50021954
#define AM_REG_INFO0_CUST_PUBKEY_W22_O 0x00001958
#define AM_REG_INFO0_CUST_PUBKEY_W22_ADDR 0x50021958
#define AM_REG_INFO0_CUST_PUBKEY_W23_O 0x0000195c
#define AM_REG_INFO0_CUST_PUBKEY_W23_ADDR 0x5002195c
#define AM_REG_INFO0_CUST_PUBKEY_W24_O 0x00001960
#define AM_REG_INFO0_CUST_PUBKEY_W24_ADDR 0x50021960
#define AM_REG_INFO0_CUST_PUBKEY_W25_O 0x00001964
#define AM_REG_INFO0_CUST_PUBKEY_W25_ADDR 0x50021964
#define AM_REG_INFO0_CUST_PUBKEY_W26_O 0x00001968
#define AM_REG_INFO0_CUST_PUBKEY_W26_ADDR 0x50021968
#define AM_REG_INFO0_CUST_PUBKEY_W27_O 0x0000196c
#define AM_REG_INFO0_CUST_PUBKEY_W27_ADDR 0x5002196c
#define AM_REG_INFO0_CUST_PUBKEY_W28_O 0x00001970
#define AM_REG_INFO0_CUST_PUBKEY_W28_ADDR 0x50021970
#define AM_REG_INFO0_CUST_PUBKEY_W29_O 0x00001974
#define AM_REG_INFO0_CUST_PUBKEY_W29_ADDR 0x50021974
#define AM_REG_INFO0_CUST_PUBKEY_W30_O 0x00001978
#define AM_REG_INFO0_CUST_PUBKEY_W30_ADDR 0x50021978
#define AM_REG_INFO0_CUST_PUBKEY_W31_O 0x0000197c
#define AM_REG_INFO0_CUST_PUBKEY_W31_ADDR 0x5002197c
#define AM_REG_INFO0_CUST_PUBKEY_W32_O 0x00001980
#define AM_REG_INFO0_CUST_PUBKEY_W32_ADDR 0x50021980
#define AM_REG_INFO0_CUST_PUBKEY_W33_O 0x00001984
#define AM_REG_INFO0_CUST_PUBKEY_W33_ADDR 0x50021984
#define AM_REG_INFO0_CUST_PUBKEY_W34_O 0x00001988
#define AM_REG_INFO0_CUST_PUBKEY_W34_ADDR 0x50021988
#define AM_REG_INFO0_CUST_PUBKEY_W35_O 0x0000198c
#define AM_REG_INFO0_CUST_PUBKEY_W35_ADDR 0x5002198c
#define AM_REG_INFO0_CUST_PUBKEY_W36_O 0x00001990
#define AM_REG_INFO0_CUST_PUBKEY_W36_ADDR 0x50021990
#define AM_REG_INFO0_CUST_PUBKEY_W37_O 0x00001994
#define AM_REG_INFO0_CUST_PUBKEY_W37_ADDR 0x50021994
#define AM_REG_INFO0_CUST_PUBKEY_W38_O 0x00001998
#define AM_REG_INFO0_CUST_PUBKEY_W38_ADDR 0x50021998
#define AM_REG_INFO0_CUST_PUBKEY_W39_O 0x0000199c
#define AM_REG_INFO0_CUST_PUBKEY_W39_ADDR 0x5002199c
#define AM_REG_INFO0_CUST_PUBKEY_W40_O 0x000019a0
#define AM_REG_INFO0_CUST_PUBKEY_W40_ADDR 0x500219a0
#define AM_REG_INFO0_CUST_PUBKEY_W41_O 0x000019a4
#define AM_REG_INFO0_CUST_PUBKEY_W41_ADDR 0x500219a4
#define AM_REG_INFO0_CUST_PUBKEY_W42_O 0x000019a8
#define AM_REG_INFO0_CUST_PUBKEY_W42_ADDR 0x500219a8
#define AM_REG_INFO0_CUST_PUBKEY_W43_O 0x000019ac
#define AM_REG_INFO0_CUST_PUBKEY_W43_ADDR 0x500219ac
#define AM_REG_INFO0_CUST_PUBKEY_W44_O 0x000019b0
#define AM_REG_INFO0_CUST_PUBKEY_W44_ADDR 0x500219b0
#define AM_REG_INFO0_CUST_PUBKEY_W45_O 0x000019b4
#define AM_REG_INFO0_CUST_PUBKEY_W45_ADDR 0x500219b4
#define AM_REG_INFO0_CUST_PUBKEY_W46_O 0x000019b8
#define AM_REG_INFO0_CUST_PUBKEY_W46_ADDR 0x500219b8
#define AM_REG_INFO0_CUST_PUBKEY_W47_O 0x000019bc
#define AM_REG_INFO0_CUST_PUBKEY_W47_ADDR 0x500219bc
#define AM_REG_INFO0_CUST_PUBKEY_W48_O 0x000019c0
#define AM_REG_INFO0_CUST_PUBKEY_W48_ADDR 0x500219c0
#define AM_REG_INFO0_CUST_PUBKEY_W49_O 0x000019c4
#define AM_REG_INFO0_CUST_PUBKEY_W49_ADDR 0x500219c4
#define AM_REG_INFO0_CUST_PUBKEY_W50_O 0x000019c8
#define AM_REG_INFO0_CUST_PUBKEY_W50_ADDR 0x500219c8
#define AM_REG_INFO0_CUST_PUBKEY_W51_O 0x000019cc
#define AM_REG_INFO0_CUST_PUBKEY_W51_ADDR 0x500219cc
#define AM_REG_INFO0_CUST_PUBKEY_W52_O 0x000019d0
#define AM_REG_INFO0_CUST_PUBKEY_W52_ADDR 0x500219d0
#define AM_REG_INFO0_CUST_PUBKEY_W53_O 0x000019d4
#define AM_REG_INFO0_CUST_PUBKEY_W53_ADDR 0x500219d4
#define AM_REG_INFO0_CUST_PUBKEY_W54_O 0x000019d8
#define AM_REG_INFO0_CUST_PUBKEY_W54_ADDR 0x500219d8
#define AM_REG_INFO0_CUST_PUBKEY_W55_O 0x000019dc
#define AM_REG_INFO0_CUST_PUBKEY_W55_ADDR 0x500219dc
#define AM_REG_INFO0_CUST_PUBKEY_W56_O 0x000019e0
#define AM_REG_INFO0_CUST_PUBKEY_W56_ADDR 0x500219e0
#define AM_REG_INFO0_CUST_PUBKEY_W57_O 0x000019e4
#define AM_REG_INFO0_CUST_PUBKEY_W57_ADDR 0x500219e4
#define AM_REG_INFO0_CUST_PUBKEY_W58_O 0x000019e8
#define AM_REG_INFO0_CUST_PUBKEY_W58_ADDR 0x500219e8
#define AM_REG_INFO0_CUST_PUBKEY_W59_O 0x000019ec
#define AM_REG_INFO0_CUST_PUBKEY_W59_ADDR 0x500219ec
#define AM_REG_INFO0_CUST_PUBKEY_W60_O 0x000019f0
#define AM_REG_INFO0_CUST_PUBKEY_W60_ADDR 0x500219f0
#define AM_REG_INFO0_CUST_PUBKEY_W61_O 0x000019f4
#define AM_REG_INFO0_CUST_PUBKEY_W61_ADDR 0x500219f4
#define AM_REG_INFO0_CUST_PUBKEY_W62_O 0x000019f8
#define AM_REG_INFO0_CUST_PUBKEY_W62_ADDR 0x500219f8
#define AM_REG_INFO0_CUST_PUBKEY_W63_O 0x000019fc
#define AM_REG_INFO0_CUST_PUBKEY_W63_ADDR 0x500219fc
#define AM_REG_INFO0_CUSTOMER_KEY0_O 0x00001a00
#define AM_REG_INFO0_CUSTOMER_KEY0_ADDR 0x50021a00
#define AM_REG_INFO0_CUSTOMER_KEY1_O 0x00001a04
#define AM_REG_INFO0_CUSTOMER_KEY1_ADDR 0x50021a04
#define AM_REG_INFO0_CUSTOMER_KEY2_O 0x00001a08
#define AM_REG_INFO0_CUSTOMER_KEY2_ADDR 0x50021a08
#define AM_REG_INFO0_CUSTOMER_KEY3_O 0x00001a0c
#define AM_REG_INFO0_CUSTOMER_KEY3_ADDR 0x50021a0c
#define AM_REG_INFO0_CUST_PUBHASH_W0_O 0x00001a10
#define AM_REG_INFO0_CUST_PUBHASH_W0_ADDR 0x50021a10
#define AM_REG_INFO0_CUST_PUBHASH_W1_O 0x00001a14
#define AM_REG_INFO0_CUST_PUBHASH_W1_ADDR 0x50021a14
#define AM_REG_INFO0_CUST_PUBHASH_W2_O 0x00001a18
#define AM_REG_INFO0_CUST_PUBHASH_W2_ADDR 0x50021a18
#define AM_REG_INFO0_CUST_PUBHASH_W3_O 0x00001a1c
#define AM_REG_INFO0_CUST_PUBHASH_W3_ADDR 0x50021a1c
#define AM_REG_INFO0_CUSTID_O 0x00001a20
#define AM_REG_INFO0_CUSTID_ADDR 0x50021a20

// SIGNATURE0 - This is word 0 (low word, bits 31:0) of the 128-bit INFO0 signature. The value in SIGNATURE* determines if the rest of INFO0 is valid.
#define AM_REG_INFO0_SIGNATURE0_SIG0_S 0
#define AM_REG_INFO0_SIGNATURE0_SIG0_M 0xFFFFFFFF
#define AM_REG_INFO0_SIGNATURE0_SIG0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SIGNATURE1 - Word 1 (bits 63:32) of the 128-bit INFO0 signature. The value in SIGNATURE* determines if the rest of INFO0 is valid.
#define AM_REG_INFO0_SIGNATURE1_SIG1_S 0
#define AM_REG_INFO0_SIGNATURE1_SIG1_M 0xFFFFFFFF
#define AM_REG_INFO0_SIGNATURE1_SIG1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SIGNATURE2 - Word 2 (bits 95:64) of the 128-bit INFO0 signature. The value in SIGNATURE* determines if the rest of INFO0 is valid.
#define AM_REG_INFO0_SIGNATURE2_SIG2_S 0
#define AM_REG_INFO0_SIGNATURE2_SIG2_M 0xFFFFFFFF
#define AM_REG_INFO0_SIGNATURE2_SIG2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SIGNATURE3 - Word 3 (high word, bits 127:96) of the 128-bit INFO0 signature. The value in SIGNATURE* determines if the rest of INFO0 is valid.
#define AM_REG_INFO0_SIGNATURE3_SIG3_S 0
#define AM_REG_INFO0_SIGNATURE3_SIG3_M 0xFFFFFFFF
#define AM_REG_INFO0_SIGNATURE3_SIG3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SECURITY - This 32-bit word contains the customer programmable security.
#define AM_REG_INFO0_SECURITY_SECPOL_S 24
#define AM_REG_INFO0_SECURITY_SECPOL_M 0x07000000
#define AM_REG_INFO0_SECURITY_SECPOL(n) (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_INFO0_SECURITY_KEYWRAP_S 20
#define AM_REG_INFO0_SECURITY_KEYWRAP_M 0x00F00000
#define AM_REG_INFO0_SECURITY_KEYWRAP(n) (((uint32_t)(n) << 20) & 0x00F00000)
#define AM_REG_INFO0_SECURITY_RSVD19_S 19
#define AM_REG_INFO0_SECURITY_RSVD19_M 0x00080000
#define AM_REG_INFO0_SECURITY_RSVD19(n) (((uint32_t)(n) << 19) & 0x00080000)
#define AM_REG_INFO0_SECURITY_SECBOOTONRST_S 16
#define AM_REG_INFO0_SECURITY_SECBOOTONRST_M 0x00070000
#define AM_REG_INFO0_SECURITY_SECBOOTONRST(n) (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_INFO0_SECURITY_RSVD15_S 15
#define AM_REG_INFO0_SECURITY_RSVD15_M 0x00008000
#define AM_REG_INFO0_SECURITY_RSVD15(n) (((uint32_t)(n) << 15) & 0x00008000)
#define AM_REG_INFO0_SECURITY_SECBOOT_S 12
#define AM_REG_INFO0_SECURITY_SECBOOT_M 0x00007000
#define AM_REG_INFO0_SECURITY_SECBOOT(n) (((uint32_t)(n) << 12) & 0x00007000)
#define AM_REG_INFO0_SECURITY_PLONEXIT_S 11
#define AM_REG_INFO0_SECURITY_PLONEXIT_M 0x00000800
#define AM_REG_INFO0_SECURITY_PLONEXIT(n) (((uint32_t)(n) << 11) & 0x00000800)
#define AM_REG_INFO0_SECURITY_SDBG_S 10
#define AM_REG_INFO0_SECURITY_SDBG_M 0x00000400
#define AM_REG_INFO0_SECURITY_SDBG(n) (((uint32_t)(n) << 10) & 0x00000400)
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET_S 9
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET_M 0x00000200
#define AM_REG_INFO0_SECURITY_BOOTLOADER_AT_RESET(n) (((uint32_t)(n) << 9) & 0x00000200)
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE_S 8
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE_M 0x00000100
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_ERASE(n) (((uint32_t)(n) << 8) & 0x00000100)
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG_S 4
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG_M 0x000000F0
#define AM_REG_INFO0_SECURITY_EN_CUST_INFO_PROG(n) (((uint32_t)(n) << 4) & 0x000000F0)
#define AM_REG_INFO0_SECURITY_SECURE_LOCK_S 3
#define AM_REG_INFO0_SECURITY_SECURE_LOCK_M 0x00000008
#define AM_REG_INFO0_SECURITY_SECURE_LOCK(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_SECURITY_RSVD02_S 2
#define AM_REG_INFO0_SECURITY_RSVD02_M 0x00000004
#define AM_REG_INFO0_SECURITY_RSVD02(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_SECURITY_RSVD01_S 1
#define AM_REG_INFO0_SECURITY_RSVD01_M 0x00000002
#define AM_REG_INFO0_SECURITY_RSVD01(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_SECURITY_DEBUG_PROT_S 0
#define AM_REG_INFO0_SECURITY_DEBUG_PROT_M 0x00000001
#define AM_REG_INFO0_SECURITY_DEBUG_PROT(n) (((uint32_t)(n) << 0) & 0x00000001)

