apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
// CUSTOMER_TRIM - Customer Programmable trim overrides.  Bits in this register are loaded into hardware registers at reset.
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL_S 3
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL_M 0x00000008
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEM_CTRL(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_enable_S 2
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_enable_M 0x00000004
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_FEATURE_enable(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_enable_S 1
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_enable_M 0x00000002
#define AM_REG_INFO0_CUSTOMER_TRIM_BLE_BUCK_enable(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_enable_S 0
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_enable_M 0x00000001
#define AM_REG_INFO0_CUSTOMER_TRIM_SIMO_BUCK_enable(n) (((uint32_t)(n) << 0) & 0x00000001)

// CUSTOMER_TRIM2 - Customer Programmable trim overrides.  Bits in this register are used by software for hardware configuration.
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM_S 0
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM_M 0x000007FF
#define AM_REG_INFO0_CUSTOMER_TRIM2_XO32M_FREQ_TRIM(n) (((uint32_t)(n) << 0) & 0x000007FF)

// SECURITY_OVR - This 32-bit word contains the override configuration for forcing GPIO-based firmware update.
#define AM_REG_INFO0_SECURITY_OVR_POL_S 7
#define AM_REG_INFO0_SECURITY_OVR_POL_M 0x00000080
#define AM_REG_INFO0_SECURITY_OVR_POL(n) (((uint32_t)(n) << 7) & 0x00000080)
#define AM_REG_INFO0_SECURITY_OVR_GPIO_S 0
#define AM_REG_INFO0_SECURITY_OVR_GPIO_M 0x0000007F
#define AM_REG_INFO0_SECURITY_OVR_GPIO(n) (((uint32_t)(n) << 0) & 0x0000007F)

// SECURITY_WIRED_CFG - This 32-bit word contains the configuration for the wired update interface.
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT_S 16
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT_M 0xFFFF0000
#define AM_REG_INFO0_SECURITY_WIRED_CFG_TIMEOUT(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR_S 9
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR_M 0x0000FE00
#define AM_REG_INFO0_SECURITY_WIRED_CFG_I2CADDR(n) (((uint32_t)(n) << 9) & 0x0000FE00)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN_S 3
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN_M 0x000001F8
#define AM_REG_INFO0_SECURITY_WIRED_CFG_SLVINTPIN(n) (((uint32_t)(n) << 3) & 0x000001F8)
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC_S 0
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC_M 0x00000007
#define AM_REG_INFO0_SECURITY_WIRED_CFG_IFC(n) (((uint32_t)(n) << 0) & 0x00000007)

// SECURITY_WIRED_IFC_CFG0 - This 32-bit word contains the interface configuration word0 for the UART wired update.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_M 0x0FFFFF00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE(n) (((uint32_t)(n) << 8) & 0x0FFFFF00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_S 6
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_M 0x000000C0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN(n) (((uint32_t)(n) << 6) & 0x000000C0)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_S 5
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_M 0x00000020
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP(n) (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_S 4
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_M 0x00000010
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN(n) (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_S 3
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_M 0x00000008
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_PAR(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_S 2
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_M 0x00000004
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_CTS(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_S 1
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_M 0x00000002
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_RTS(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART_M 0x00000001
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG0_UART(n) (((uint32_t)(n) << 0) & 0x00000001)

// SECURITY_WIRED_IFC_CFG1 - This 32-bit word contains the interface configuration word1 for the UART wired update.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_M 0x0000FF00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG2 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 0.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG2_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

