apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
// SECURITY_WIRED_IFC_CFG3 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 1.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG3_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG4 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 2.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG4_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_WIRED_IFC_CFG5 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 3.
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2_S 24
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2_M 0xFF000000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD2(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG_S 16
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG_M 0x00FF0000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_ALTPADCFG(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1_S 12
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1_M 0x0000F000
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_RSVD1(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG_S 8
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG_M 0x00000F00
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_GPIOCFG(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG_S 0
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG_M 0x000000FF
#define AM_REG_INFO0_SECURITY_WIRED_IFC_CFG5_PADCFG(n) (((uint32_t)(n) << 0) & 0x000000FF)

// SECURITY_VERSION - This 32-bit word contains the version ID used for revision control
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_S 0
#define AM_REG_INFO0_SECURITY_VERSION_VERSION_M 0xFFFFFFFF
#define AM_REG_INFO0_SECURITY_VERSION_VERSION(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// SECURITY_SRAM_RESV - This 16-bit word indicates the amount of SRAM to keep reserved for application scratch space. This reserves the specified memory at the top end of SRAM memory address range. This memory is not disturbed by the Secure Boot Loader. Please note that future releases of SBL may increase the width of this field to 18 bits.
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_S 0
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV_M 0x0000FFFF
#define AM_REG_INFO0_SECURITY_SRAM_RESV_SRAM_RESV(n) (((uint32_t)(n) << 0) & 0x0000FFFF)

// WRITE_PROTECT_L - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_L_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_L_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_L_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_H - These bits write-protect flash in 16KB chunks.
#define AM_REG_INFO0_WRITE_PROTECT_H_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_H_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_H_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_L - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_L_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_L_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_L_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_H - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_H_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_H_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_H_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_SBL_L - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_L_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_L_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_L_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// WRITE_PROTECT_SBL_H - These bits write-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_WRITE_PROTECT_SBL_H_CHUNKS_S 0
#define AM_REG_INFO0_WRITE_PROTECT_SBL_H_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_WRITE_PROTECT_SBL_H_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_L - These bits read-protect flash in 16KB chunks.
#define AM_REG_INFO0_COPY_PROTECT_SBL_L_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_L_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_L_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// COPY_PROTECT_SBL_H - These bits read-protect flash in 16KB chunks. Only SBL can override these through Secure OTA
#define AM_REG_INFO0_COPY_PROTECT_SBL_H_CHUNKS_S 0
#define AM_REG_INFO0_COPY_PROTECT_SBL_H_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_COPY_PROTECT_SBL_H_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_PTR0 - This is the main/sbl_main firmware pointer 0 referenced by sbl_init for pointing to the main or sbl_main base address
#define AM_REG_INFO0_MAIN_PTR0_PTR0_S 0
#define AM_REG_INFO0_MAIN_PTR0_PTR0_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_PTR0_PTR0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_PTR1 - This is the main/sbl_main firmware pointer 1 referenced by sbl_init for pointing to the main or sbl_main base address
#define AM_REG_INFO0_MAIN_PTR1_PTR1_S 0
#define AM_REG_INFO0_MAIN_PTR1_PTR1_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_PTR1_PTR1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// KREVTRACK - KEK Key Revocation Tracker. Monotonic counter where bits represents validity of a key index (each key index represents a 128b key in the keybank). Bit 31 represents first OEM key index (8) and bit 24 represents last OEM key index (15). Bits 0-23 are reserved. Example: To revoke KEK8, the INFO0:KREVTRACK would need to be updated to 0x7FFFFFFF.
#define AM_REG_INFO0_KREVTRACK_KTRCKER_S 24
#define AM_REG_INFO0_KREVTRACK_KTRCKER_M 0xFF000000
#define AM_REG_INFO0_KREVTRACK_KTRCKER(n) (((uint32_t)(n) << 24) & 0xFF000000)

// AREVTRACK - AUTH Key Revocation Tracker. Monotonic counter where bits represents validity of a key index (each key index represents a 128b key in the keybank). Bit 31 represents first OEM key index (8) and bit 24 represents last OEM key index (15). Bits 0-23 are reserved. Example: To revoke AUTH8, the INFO0:AREVTRACK would need to be updated to 0x7FFFFFFF.
#define AM_REG_INFO0_AREVTRACK_ATRCKER_S 0
#define AM_REG_INFO0_AREVTRACK_ATRCKER_M 0xFFFFFFFF
#define AM_REG_INFO0_AREVTRACK_ATRCKER(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// OTA_DESCRIPTOR - This field is used to track the OTA DESCRIPTOR pointer to ensure proper OTA update.
#define AM_REG_INFO0_OTA_DESCRIPTOR_DESCRIPTOR_S 0
#define AM_REG_INFO0_OTA_DESCRIPTOR_DESCRIPTOR_M 0xFFFFFFFF
#define AM_REG_INFO0_OTA_DESCRIPTOR_DESCRIPTOR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_CNT0 - Index counter for main or sbl_main firmware. Counter is used to indicate which pointer to reference, MAINPTR1 or MAINPTR2
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR_S 0
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_CNT0_INDXCNTR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// MAIN_CNT1 - Index counter for main or sbl_main firmware. Counter is used to indicate which pointer to reference, MAINPTR1 or MAINPTR2
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR_S 0
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR_M 0xFFFFFFFF
#define AM_REG_INFO0_MAIN_CNT1_INDXCNTR(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W0 - This is the Customer KEK Word0. Keys are represented using key Index. Valid values for OEM key indices are 8-15. Each key index comprises of 128 bits (4 words) in the keybank, with words CUST_KEK_W0-3 representing key index 8, and so on.
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0_S 0
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W0_CUSTKEK_W0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W1 - This is the Customer KEK Word1.
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1_S 0
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W1_CUSTKEK_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_KEK_W2 - This is the Customer KEK Word2.
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2_S 0
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_KEK_W2_CUSTKEK_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

