apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
// CUST_AUTH_W1 - This is the Customer AUTH Key Word1.
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1_S 0
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W1_CUSTAUTH_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W2 - This is the Customer AUTH Key Word2.
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2_S 0
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W2_CUSTAUTH_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W3 - This is the Customer AUTH Key Word3.
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3_S 0
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W3_CUSTAUTH_W3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W4 - This is the Customer AUTH Key Word4.
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4_S 0
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W4_CUSTAUTH_W4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W5 - This is the Customer AUTH Key Word5.
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5_S 0
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W5_CUSTAUTH_W5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W6 - This is the Customer AUTH Key Word6.
#define AM_REG_INFO0_CUST_AUTH_W6_CUSTAUTH_W6_S 0
#define AM_REG_INFO0_CUST_AUTH_W6_CUSTAUTH_W6_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W6_CUSTAUTH_W6(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W7 - This is the Customer AUTH Key Word7.
#define AM_REG_INFO0_CUST_AUTH_W7_CUSTAUTH_W7_S 0
#define AM_REG_INFO0_CUST_AUTH_W7_CUSTAUTH_W7_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W7_CUSTAUTH_W7(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W8 - This is the Customer AUTH Key Word8.
#define AM_REG_INFO0_CUST_AUTH_W8_CUSTAUTH_W8_S 0
#define AM_REG_INFO0_CUST_AUTH_W8_CUSTAUTH_W8_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W8_CUSTAUTH_W8(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W9 - This is the Customer AUTH Key Word9.
#define AM_REG_INFO0_CUST_AUTH_W9_CUSTAUTH_W9_S 0
#define AM_REG_INFO0_CUST_AUTH_W9_CUSTAUTH_W9_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W9_CUSTAUTH_W9(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W10 - This is the Customer AUTH Key Word10.
#define AM_REG_INFO0_CUST_AUTH_W10_CUSTAUTH_W10_S 0
#define AM_REG_INFO0_CUST_AUTH_W10_CUSTAUTH_W10_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W10_CUSTAUTH_W10(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W11 - This is the Customer AUTH Key Word11.
#define AM_REG_INFO0_CUST_AUTH_W11_CUSTAUTH_W11_S 0
#define AM_REG_INFO0_CUST_AUTH_W11_CUSTAUTH_W11_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W11_CUSTAUTH_W11(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W12 - This is the Customer AUTH Key Word12.
#define AM_REG_INFO0_CUST_AUTH_W12_CUSTAUTH_W12_S 0
#define AM_REG_INFO0_CUST_AUTH_W12_CUSTAUTH_W12_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W12_CUSTAUTH_W12(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W13 - This is the Customer AUTH Key Word13.
#define AM_REG_INFO0_CUST_AUTH_W13_CUSTAUTH_W13_S 0
#define AM_REG_INFO0_CUST_AUTH_W13_CUSTAUTH_W13_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W13_CUSTAUTH_W13(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W14 - This is the Customer AUTH Key Word14.
#define AM_REG_INFO0_CUST_AUTH_W14_CUSTAUTH_W14_S 0
#define AM_REG_INFO0_CUST_AUTH_W14_CUSTAUTH_W14_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W14_CUSTAUTH_W14(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W15 - This is the Customer AUTH Key Word15.
#define AM_REG_INFO0_CUST_AUTH_W15_CUSTAUTH_W15_S 0
#define AM_REG_INFO0_CUST_AUTH_W15_CUSTAUTH_W15_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W15_CUSTAUTH_W15(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W16 - This is the Customer AUTH Key Word16.
#define AM_REG_INFO0_CUST_AUTH_W16_CUSTAUTH_W16_S 0
#define AM_REG_INFO0_CUST_AUTH_W16_CUSTAUTH_W16_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W16_CUSTAUTH_W16(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W17 - This is the Customer AUTH Key Word17.
#define AM_REG_INFO0_CUST_AUTH_W17_CUSTAUTH_W17_S 0
#define AM_REG_INFO0_CUST_AUTH_W17_CUSTAUTH_W17_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W17_CUSTAUTH_W17(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W18 - This is the Customer AUTH Key Word18.
#define AM_REG_INFO0_CUST_AUTH_W18_CUSTAUTH_W18_S 0
#define AM_REG_INFO0_CUST_AUTH_W18_CUSTAUTH_W18_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W18_CUSTAUTH_W18(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W19 - This is the Customer AUTH Key Word19.
#define AM_REG_INFO0_CUST_AUTH_W19_CUSTAUTH_W19_S 0
#define AM_REG_INFO0_CUST_AUTH_W19_CUSTAUTH_W19_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W19_CUSTAUTH_W19(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W20 - This is the Customer AUTH Key Word20.
#define AM_REG_INFO0_CUST_AUTH_W20_CUSTAUTH_W20_S 0
#define AM_REG_INFO0_CUST_AUTH_W20_CUSTAUTH_W20_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W20_CUSTAUTH_W20(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W21 - This is the Customer AUTH Key Word21.
#define AM_REG_INFO0_CUST_AUTH_W21_CUSTAUTH_W21_S 0
#define AM_REG_INFO0_CUST_AUTH_W21_CUSTAUTH_W21_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W21_CUSTAUTH_W21(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W22 - This is the Customer AUTH Key Word22.
#define AM_REG_INFO0_CUST_AUTH_W22_CUSTAUTH_W22_S 0
#define AM_REG_INFO0_CUST_AUTH_W22_CUSTAUTH_W22_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W22_CUSTAUTH_W22(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W23 - This is the Customer AUTH Key Word23.
#define AM_REG_INFO0_CUST_AUTH_W23_CUSTAUTH_W23_S 0
#define AM_REG_INFO0_CUST_AUTH_W23_CUSTAUTH_W23_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W23_CUSTAUTH_W23(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W24 - This is the Customer AUTH Key Word24.
#define AM_REG_INFO0_CUST_AUTH_W24_CUSTAUTH_W24_S 0
#define AM_REG_INFO0_CUST_AUTH_W24_CUSTAUTH_W24_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W24_CUSTAUTH_W24(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W25 - This is the Customer AUTH Key Word25.
#define AM_REG_INFO0_CUST_AUTH_W25_CUSTAUTH_W25_S 0
#define AM_REG_INFO0_CUST_AUTH_W25_CUSTAUTH_W25_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W25_CUSTAUTH_W25(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W26 - This is the Customer AUTH Key Word26.
#define AM_REG_INFO0_CUST_AUTH_W26_CUSTAUTH_W26_S 0
#define AM_REG_INFO0_CUST_AUTH_W26_CUSTAUTH_W26_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W26_CUSTAUTH_W26(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_AUTH_W27 - This is the Customer AUTH Key Word27.
#define AM_REG_INFO0_CUST_AUTH_W27_CUSTAUTH_W27_S 0
#define AM_REG_INFO0_CUST_AUTH_W27_CUSTAUTH_W27_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_AUTH_W27_CUSTAUTH_W27(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

