apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
// CUST_PUBKEY_W25 - This is the Customer Public Key Word25.
#define AM_REG_INFO0_CUST_PUBKEY_W25_CUSTPUBKEY_W25_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W25_CUSTPUBKEY_W25_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W25_CUSTPUBKEY_W25(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W26 - This is the Customer Public Key Word26.
#define AM_REG_INFO0_CUST_PUBKEY_W26_CUSTPUBKEY_W26_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W26_CUSTPUBKEY_W26_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W26_CUSTPUBKEY_W26(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W27 - This is the Customer Public Key Word27.
#define AM_REG_INFO0_CUST_PUBKEY_W27_CUSTPUBKEY_W27_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W27_CUSTPUBKEY_W27_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W27_CUSTPUBKEY_W27(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W28 - This is the Customer Public Key Word28.
#define AM_REG_INFO0_CUST_PUBKEY_W28_CUSTPUBKEY_W28_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W28_CUSTPUBKEY_W28_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W28_CUSTPUBKEY_W28(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W29 - This is the Customer Public Key Word29.
#define AM_REG_INFO0_CUST_PUBKEY_W29_CUSTPUBKEY_W29_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W29_CUSTPUBKEY_W29_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W29_CUSTPUBKEY_W29(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W30 - This is the Customer Public Key Word30.
#define AM_REG_INFO0_CUST_PUBKEY_W30_CUSTPUBKEY_W30_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W30_CUSTPUBKEY_W30_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W30_CUSTPUBKEY_W30(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W31 - This is the Customer Public Key Word31.
#define AM_REG_INFO0_CUST_PUBKEY_W31_CUSTPUBKEY_W31_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W31_CUSTPUBKEY_W31_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W31_CUSTPUBKEY_W31(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W32 - This is the Customer Public Key Word32.
#define AM_REG_INFO0_CUST_PUBKEY_W32_CUSTPUBKEY_W32_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W32_CUSTPUBKEY_W32_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W32_CUSTPUBKEY_W32(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W33 - This is the Customer Public Key Word33.
#define AM_REG_INFO0_CUST_PUBKEY_W33_CUSTPUBKEY_W33_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W33_CUSTPUBKEY_W33_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W33_CUSTPUBKEY_W33(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W34 - This is the Customer Public Key Word34.
#define AM_REG_INFO0_CUST_PUBKEY_W34_CUSTPUBKEY_W34_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W34_CUSTPUBKEY_W34_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W34_CUSTPUBKEY_W34(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W35 - This is the Customer Public Key Word35.
#define AM_REG_INFO0_CUST_PUBKEY_W35_CUSTPUBKEY_W35_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W35_CUSTPUBKEY_W35_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W35_CUSTPUBKEY_W35(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W36 - This is the Customer Public Key Word36.
#define AM_REG_INFO0_CUST_PUBKEY_W36_CUSTPUBKEY_W36_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W36_CUSTPUBKEY_W36_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W36_CUSTPUBKEY_W36(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W37 - This is the Customer Public Key Word37.
#define AM_REG_INFO0_CUST_PUBKEY_W37_CUSTPUBKEY_W37_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W37_CUSTPUBKEY_W37_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W37_CUSTPUBKEY_W37(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W38 - This is the Customer Public Key Word38.
#define AM_REG_INFO0_CUST_PUBKEY_W38_CUSTPUBKEY_W38_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W38_CUSTPUBKEY_W38_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W38_CUSTPUBKEY_W38(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W39 - This is the Customer Public Key Word39.
#define AM_REG_INFO0_CUST_PUBKEY_W39_CUSTPUBKEY_W39_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W39_CUSTPUBKEY_W39_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W39_CUSTPUBKEY_W39(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W40 - This is the Customer Public Key Word40.
#define AM_REG_INFO0_CUST_PUBKEY_W40_CUSTPUBKEY_W40_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W40_CUSTPUBKEY_W40_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W40_CUSTPUBKEY_W40(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W41 - This is the Customer Public Key Word41.
#define AM_REG_INFO0_CUST_PUBKEY_W41_CUSTPUBKEY_W41_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W41_CUSTPUBKEY_W41_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W41_CUSTPUBKEY_W41(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W42 - This is the Customer Public Key Word42.
#define AM_REG_INFO0_CUST_PUBKEY_W42_CUSTPUBKEY_W42_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W42_CUSTPUBKEY_W42_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W42_CUSTPUBKEY_W42(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W43 - This is the Customer Public Key Word43.
#define AM_REG_INFO0_CUST_PUBKEY_W43_CUSTPUBKEY_W43_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W43_CUSTPUBKEY_W43_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W43_CUSTPUBKEY_W43(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W44 - This is the Customer Public Key Word44.
#define AM_REG_INFO0_CUST_PUBKEY_W44_CUSTPUBKEY_W44_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W44_CUSTPUBKEY_W44_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W44_CUSTPUBKEY_W44(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W45 - This is the Customer Public Key Word45.
#define AM_REG_INFO0_CUST_PUBKEY_W45_CUSTPUBKEY_W45_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W45_CUSTPUBKEY_W45_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W45_CUSTPUBKEY_W45(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W46 - This is the Customer Public Key Word46.
#define AM_REG_INFO0_CUST_PUBKEY_W46_CUSTPUBKEY_W46_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W46_CUSTPUBKEY_W46_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W46_CUSTPUBKEY_W46(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W47 - This is the Customer Public Key Word47.
#define AM_REG_INFO0_CUST_PUBKEY_W47_CUSTPUBKEY_W47_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W47_CUSTPUBKEY_W47_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W47_CUSTPUBKEY_W47(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W48 - This is the Customer Public Key Word48.
#define AM_REG_INFO0_CUST_PUBKEY_W48_CUSTPUBKEY_W48_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W48_CUSTPUBKEY_W48_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W48_CUSTPUBKEY_W48(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

