apache/mynewt-core/hw/mcu/ambiq/apollo3/src/ext/AmbiqSuite/mcu/apollo3/regs/am_mcu_apollo3_info0.h
// CUST_PUBKEY_W49 - This is the Customer Public Key Word49.
#define AM_REG_INFO0_CUST_PUBKEY_W49_CUSTPUBKEY_W49_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W49_CUSTPUBKEY_W49_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W49_CUSTPUBKEY_W49(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W50 - This is the Customer Public Key Word50.
#define AM_REG_INFO0_CUST_PUBKEY_W50_CUSTPUBKEY_W50_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W50_CUSTPUBKEY_W50_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W50_CUSTPUBKEY_W50(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W51 - This is the Customer Public Key Word51.
#define AM_REG_INFO0_CUST_PUBKEY_W51_CUSTPUBKEY_W51_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W51_CUSTPUBKEY_W51_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W51_CUSTPUBKEY_W51(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W52 - This is the Customer Public Key Word52.
#define AM_REG_INFO0_CUST_PUBKEY_W52_CUSTPUBKEY_W52_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W52_CUSTPUBKEY_W52_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W52_CUSTPUBKEY_W52(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W53 - This is the Customer Public Key Word53.
#define AM_REG_INFO0_CUST_PUBKEY_W53_CUSTPUBKEY_W53_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W53_CUSTPUBKEY_W53_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W53_CUSTPUBKEY_W53(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W54 - This is the Customer Public Key Word54.
#define AM_REG_INFO0_CUST_PUBKEY_W54_CUSTPUBKEY_W54_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W54_CUSTPUBKEY_W54_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W54_CUSTPUBKEY_W54(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W55 - This is the Customer Public Key Word55.
#define AM_REG_INFO0_CUST_PUBKEY_W55_CUSTPUBKEY_W55_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W55_CUSTPUBKEY_W55_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W55_CUSTPUBKEY_W55(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W56 - This is the Customer Public Key Word56.
#define AM_REG_INFO0_CUST_PUBKEY_W56_CUSTPUBKEY_W56_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W56_CUSTPUBKEY_W56_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W56_CUSTPUBKEY_W56(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W57 - This is the Customer Public Key Word57.
#define AM_REG_INFO0_CUST_PUBKEY_W57_CUSTPUBKEY_W57_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W57_CUSTPUBKEY_W57_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W57_CUSTPUBKEY_W57(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W58 - This is the Customer Public Key Word58.
#define AM_REG_INFO0_CUST_PUBKEY_W58_CUSTPUBKEY_W58_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W58_CUSTPUBKEY_W58_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W58_CUSTPUBKEY_W58(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W59 - This is the Customer Public Key Word59.
#define AM_REG_INFO0_CUST_PUBKEY_W59_CUSTPUBKEY_W59_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W59_CUSTPUBKEY_W59_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W59_CUSTPUBKEY_W59(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W60 - This is the Customer Public Key Word60.
#define AM_REG_INFO0_CUST_PUBKEY_W60_CUSTPUBKEY_W60_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W60_CUSTPUBKEY_W60_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W60_CUSTPUBKEY_W60(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W61 - This is the Customer Public Key Word61.
#define AM_REG_INFO0_CUST_PUBKEY_W61_CUSTPUBKEY_W61_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W61_CUSTPUBKEY_W61_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W61_CUSTPUBKEY_W61(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W62 - This is the Customer Public Key Word62.
#define AM_REG_INFO0_CUST_PUBKEY_W62_CUSTPUBKEY_W62_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W62_CUSTPUBKEY_W62_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W62_CUSTPUBKEY_W62(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBKEY_W63 - This is the Customer Public Key Word63.
#define AM_REG_INFO0_CUST_PUBKEY_W63_CUSTPUBKEY_W63_S 0
#define AM_REG_INFO0_CUST_PUBKEY_W63_CUSTPUBKEY_W63_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBKEY_W63_CUSTPUBKEY_W63(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUSTOMER_KEY0 - customer_key[31:0]
#define AM_REG_INFO0_CUSTOMER_KEY0_CHUNKS_S 0
#define AM_REG_INFO0_CUSTOMER_KEY0_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_CUSTOMER_KEY0_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUSTOMER_KEY1 - customer_key[63:32]
#define AM_REG_INFO0_CUSTOMER_KEY1_CHUNKS_S 0
#define AM_REG_INFO0_CUSTOMER_KEY1_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_CUSTOMER_KEY1_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUSTOMER_KEY2 - customer_key[95:64]
#define AM_REG_INFO0_CUSTOMER_KEY2_CHUNKS_S 0
#define AM_REG_INFO0_CUSTOMER_KEY2_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_CUSTOMER_KEY2_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUSTOMER_KEY3 - customer_key[127:96]
#define AM_REG_INFO0_CUSTOMER_KEY3_CHUNKS_S 0
#define AM_REG_INFO0_CUSTOMER_KEY3_CHUNKS_M 0xFFFFFFFF
#define AM_REG_INFO0_CUSTOMER_KEY3_CHUNKS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBHASH_W0 - This is the Customer Public Key Hash Word0.
#define AM_REG_INFO0_CUST_PUBHASH_W0_CUSTPUBHASH_W0_S 0
#define AM_REG_INFO0_CUST_PUBHASH_W0_CUSTPUBHASH_W0_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBHASH_W0_CUSTPUBHASH_W0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBHASH_W1 - This is the Customer Public Key Hash Word1.
#define AM_REG_INFO0_CUST_PUBHASH_W1_CUSTPUBHASH_W1_S 0
#define AM_REG_INFO0_CUST_PUBHASH_W1_CUSTPUBHASH_W1_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBHASH_W1_CUSTPUBHASH_W1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBHASH_W2 - This is the Customer Public Key Hash Word2.
#define AM_REG_INFO0_CUST_PUBHASH_W2_CUSTPUBHASH_W2_S 0
#define AM_REG_INFO0_CUST_PUBHASH_W2_CUSTPUBHASH_W2_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBHASH_W2_CUSTPUBHASH_W2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUST_PUBHASH_W3 - This is the Customer Public Key Hash Word3.
#define AM_REG_INFO0_CUST_PUBHASH_W3_CUSTPUBHASH_W3_S 0
#define AM_REG_INFO0_CUST_PUBHASH_W3_CUSTPUBHASH_W3_M 0xFFFFFFFF
#define AM_REG_INFO0_CUST_PUBHASH_W3_CUSTPUBHASH_W3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

// CUSTID - This is the Ambiq assigned Customer ID. This field should be initialized with a unique (OEM spe- cific) value, supplied by Ambiq to as a precondition to enable Secure Boot support.
#define AM_REG_INFO0_CUSTID_CUSTID_S 0
#define AM_REG_INFO0_CUSTID_CUSTID_M 0xFFFFFFFF
#define AM_REG_INFO0_CUSTID_CUSTID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)

#endif
